{
  "title": "G in the impolite town",
  "slug": "G-in-the-impolite-town",
  "category": "Personal",
  "date": "2026-01-13",
  "readTime": 15,
  "excerpt": "Oh god, give me strength",
  "image": "/assets/img/blog/hell.png",
  "featured": false,
  "content": "I have many friends. We share our stories to learn, to waste time, to get each other's opinions, but more importantly, to stay sane.\n\nOne friend in particular is dear to me. A villager whom I have known since kindergarten. Playful but studious. Many of us hated him because he always acted like a gentleman.\n\nWhen he is around, he does not stop talking. And his ability to tell stories is remarkable. When he starts talking, We listen, and the people around us listen. When someone responds, he only listens to the first word, then, with childish excitement, he interrupts and responds. Which usually does not offend us, because the poor guy seems to be eager to continue talking, as he accurately guesses our response and sometimes articulates it better than we would. Over time, I learned to trust him, not because he is always right, but because he is never sure of anything. He constantly changes his mind. One day, he returned from school telling his family that he does not believe in god. Another day, he says that god can't be put in words. \"God can only be felt\", he says.\n\nOver the years, our friend grew quieter. realizing that what you say can and will be used against you. And expressing youself to people who understand you is not the same as expressing yourself to the other. He learned the hard way that, words are like bullets, especially when you speak from the heart and don't know which words do which things. Being wrong is inevitable when you speak all the time.\n\nBut recently, my friend, whose name is too important to mention, is going through some bad episodes in the new town he traveled to. He told me his story, which I still find hard to believe. But I know he is telling the truth.\n\nSo our friend traveled abroad to study a Masters degree in 2021 after he completed his Bachelor's degree in Engineering. I remember him descriping how nice and welcoming the people were. He lived with other Arab tenants. Before they arrive three rooms were secured for them by some Arabs who live in the town. Two small rooms upstairs and a basement where the bathroom pipes are strangling from the ceiling that I would hear the noise from the bathroom flushing when I would call him. If the house owner lived in this house, this basement would probably be the dogs' room. But these were the dog days, and my friend knew they will be over one day.\n\nAfter completing his Masters degree he felt he is getting even closer to be entirely financially independent. Something which is of immense importance for him to stay disobedient to his family and make the critical choices like what to eat today and what hour to return home. To celebrate, he and his friend organized a big meal to all the Arab friends he knew at this town. They were all happy for him to see him graduate and sad that he is leaving the town. He was planning to continue his studies and enroll in a PhD program. Why? I asked. \"To be a professor\", he replied. I said to myself, may be he wanted to be a professor so that people will not doubt he is a gentleman when he speaks like one. But with all fairness, no one who mattered ever doubted him. I remember our circuits professor, Dr. Salman Al-hady (may his soul rest in peace), when he pointed to my friend during a lecture and said:\n\n \"\\*\\*\\* is going to be a professor.\"\n\nAt the same time, our friend had things that he worried about back home, that would not share them even with me. Like a criminal charge that he was waiting to be dropped before he can return. Moreover, starting a PhD would delay his ability to get in the job market thus delaying his ability to apply for the Permanent Residence which he needed for two imporant reasons. First, of course, to be called a Western citizen, so that people will be even more convinced that he is actually a gentleman. But also because the poor guy really needed to marry, he was convinced that he should never marry someone who is a permanent resident or a citizen when he is an immigrant, for that will create a relationship imbalance that he knew he would not be able to live with.\n\nShortly after his Masters degree was completed, our friend enrolled in a PhD program at a different town, in the same foreign country. But this time, he had a plan!\nHe will design his environment to cancel all noise and keep himself away from any distraction. This extreme measure was not only to dedicate all his time to study, but because he found that the research area he will study while interesting presents an acute learning curve that he has to overcome if he wants to excel in his domain. He was also the only PhD student in his program. More importantly, he isolated himself due to his awareness of his tendency to be easily distracted by his own thoughts something which he can't control and causes most of his time to be wasted on joyful internal dialoug. and his extremly fragile ability to focus. Knowing that he spends most his time talking to himself, he did not want to waste more time in unecessary conversation. Moreoever, when my friend moved to the new town, he chose not to stay with Arab tenants. Over the two years he spent in the first town in the dogs' basement with his Arab friends, he noticed that his English skills have not improved almost at all! He spent most of the time with Arabs or other immigrants whose English skills are not top notch. He now has an opportunity to stay with native people. Even better, he can stay with a native family and feel like home even for a short period. And he did!\n\nOn an unpleasant day, our friend saw a social media post by a younger student who lives back in his home country. An angry post, cursing life, government, people, and hoping to travel. The post brought to mind a sad scene that occasionally surfaces, where young men sell all their belongings to buy a ticket on an illegal boat and head to Europe. A trip with a 50% chance to live is more appealing for these young men than staying in their country. our friend raged because he suddenly remembered what he is running from. He wants to be a gentleman, but he is just a lucky beggar. In a not-so-distant scenario, he would be stealing his father's money to buy a ticket on that boat. Had this been the case, his best chance at life would be not to make it to the other side of the sea. He wrote a post filled with angry and impulsive words. He broke his rule of not speaking too much and was again in trouble.\n\nOne week after writing his post, he felt the people he lived with are not comfortable. He has not thought about them for he took the principles of individualism and freedom of expression quite seriously. Not because he is showing off, but because he was blind. As signs of discomfort became more clear, he quietly deleted the post. He did not consider it a defeat or a form of silencing him. But he understood that his problems are not everyone's problems, and that he has a responsibility to not distrubt people's peaceful state of mind. He was even grateful that he had a chance to remove this post as if it was never written and without consequences. Few days later, consequence came and said hi, he ignored it hoping it is talking to someone else, but he did not know what price he was about to pay.\n\nOur friend was used to sit at a coffee shop studying but never communicating with people around him, although he would never refuse to casually talk to people if someone approached him. Sitting in a public place like a coffee shop to study simply improves his focus significantly.  A well-known phenomenon called **\"Body Doubling,\"**  in which the brain treats other people as a soft accountability anchor. A group sitting behind **G,** clearly of Arabic origin, started talking behind his back while clearly referring to him. They did not approach him respectfully. They even started saying things like \"You study so hard, but what are you going to be after all that, probably not much\". **G** ignored them as if they were not there. He thought that since they did not talk to him directly, he did not have to respond and that they would give up. After a couple of days of persisting,\\*\\* G \\*\\*was convinced that they were angry because of the post he had recently written and removed. Why else would a group insist on harassing him if they don't know him. Although they were speaking in Arabic, they were so disrespectful that an English-speaking man stood up to them and said he would call the police if they did not stop. which made half of the group (\\~10 people) leave the coffee shop immediately.\n\nA month later, G woke up, as usual, and he turned on the news while preparing breakfast. Something big happened. It is October 7th. The world has changed forever. Two groups are consolidating, and suddenly people are expecting you to take your clan's side, while it has become not only wise but imminently risky for a foreign student and employee like myself to take a side and speak with my usual emotionally-charged tone."
}
